# Pandas week 4

# 13. Konversi nilai numerik ke dalam kategori pada Data Frame

In [12]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [13]:
#Data Frame Prep
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99, size=(n_rows, n_cols)),
                 columns=cols)

df

   usia
0     7
1    51
2    86
3    70
4    14
5    62
6    19
7    74
8    39
9    47

# Pengelompokan nilai numerik ke dalam bebearap kategori menggunakan cut()

In [15]:
df['Kelompok usia'] = pd.cut(df['usia'],
                            bins= [0,18,65,99],
                            labels=['anak', 'dewasa', 'manula'])
#anak: 0-18
#dewasa: 18-65
#manula: 65-99
df

   usia Kelompok usia
0     7          anak
1    51        dewasa
2    86        manula
3    70        manula
4    14          anak
5    62        dewasa
6    19        dewasa
7    74        manula
8    39        dewasa
9    47        dewasa

# 14. Menggabungkan (merge) dua Data Frame

In [18]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

Data Frame Prep

In [28]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows, n_cols)),
                 columns=cols)

df.head()

    A   B   C   D   E
0  16   1  18  16  14
1   3  17   8   1   1
2  17   2   7  16  15
3   9  19  18  13   8
4  17  15   4  15   6

In [31]:
df1= df.copy(deep = True)
df1= df1.drop([1,4])
#drop unutk membuang index yang kita mau
df1

    A   B   C   D   E
0  16   1  18  16  14
2  17   2   7  16  15
3   9  19  18  13   8

In [32]:
df2= df.copy(deep = True)
df2= df2.drop([0,4])
df2

    A   B   C   D   E
1   3  17   8   1   1
2  17   2   7  16  15
3   9  19  18  13   8

# Menggabungkan dua Data Frame

In [36]:
df_inner=pd.merge(df1,df2, how='inner')
#inner: menggabungkan dua data Frame dimana data frame yang baru akan berisi baris yang terdapat pada kedua data frame sumbernya
df_inner

    A   B   C   D   E
0  17   2   7  16  15
1   9  19  18  13   8

In [35]:
df_outer=pd.merge(df1,df2, how='outer')
#outer: menggabungkan dua data Frame dimana data frame yang baru akan berisi baris yang terdapat pada semua data frame sumbernya dan menghilangkan duplikatnya (bila ada)
df_outer

    A   B   C   D   E
0  16   1  18  16  14
1  17   2   7  16  15
2   9  19  18  13   8
3   3  17   8   1   1

# 15. Memecah nilai string suatu kolom ke dalam beberapa kolom baru

In [37]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [39]:
#Data Frame Prep
data = {'nama':['Didi kempot', 'Glenn Fredyly','Mbah Surip'],
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojoker, Jawa Timur']}

df = pd.DataFrame(data)

df

            nama        tempat_kelahiran
0    Didi kempot  Surakarta, Jawa Tengah
1  Glenn Fredyly    Jakarta, DKI Jakarta
2     Mbah Surip     Mojoker, Jawa Timur

# Memecah nama depan dan nama belakang

In [48]:
df[['nama_depan','nama_belakang']]= df['nama'].str.split(' ',expand=True)
#nama dipecah atau displit berdasarkan spasi(paramter pertama)
#paramter kedua (parameter tambahan (expand=True))
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi kempot,"Surakarta, Jawa Tengah",Didi,kempot,Surakarta,Jawa Tengah
1,Glenn Fredyly,"Jakarta, DKI Jakarta",Glenn,Fredyly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojoker, Jawa Timur",Mbah,Surip,Mojoker,Jawa Timur

# Memecah nama kota dan nama propinsi

In [46]:
df[['kota','propinsi']]= df['tempat_kelahiran'].str.split(',',expand=True)
#tempat_kelahiran dipecah atau displit berdasarkan tanda koma(,)(paramter pertama)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi kempot,"Surakarta, Jawa Tengah",Didi,kempot,Surakarta,Jawa Tengah
1,Glenn Fredyly,"Jakarta, DKI Jakarta",Glenn,Fredyly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojoker, Jawa Timur",Mbah,Surip,Mojoker,Jawa Timur

# 16. Menata ulang Data Frame dengan multiple indexes menggunakan unstack()